--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mmking/Documents/SocResearch/climate_disability/disability_d
> isaster_response/stata/disd02_variables.log
  log type:  text
 opened on:  25 Sep 2025, 17:42:55

. 
. ***--------------------------***
. // PROGRAM SETUP
. ***--------------------------***
. 
. version 18 

. set linesize 80

. clear all

. set more off

. 
. ***--------------------------***
. // DEMOGRAPHIC VARIABLES
. ***--------------------------***
. use $data/2021_NHS_general_data.dta

. 
. //DISABILITY
. gen disability = .
(7,197 missing values generated)

. replace disability = 1 if D4ADoyouhaveadisabilityor == "Disability"
(2,048 real changes made)

. replace disability = 0 if D4ADoyouhaveadisabilityor == "No Disability"
(5,149 real changes made)

. 
. label define Disability_label 1 Disability 0 "No Disability"

. label values disability Disability_label

. label var disability "Disability"

. tab D4ADoyouhaveadisabilityor disability, m

  D4A  Do you |
       have a |
disability or |
     a health |
    condition |
   that might |
  affect your |      Disability
        capac | No Disabi  Disabilit |     Total
--------------+----------------------+----------
   Disability |         0      2,048 |     2,048 
No Disability |     5,149          0 |     5,149 
--------------+----------------------+----------
        Total |     5,149      2,048 |     7,197 

. 
. //EDUCATION
. tab Educationascapturedinrawsur, m

    Education as captured in raw survey |
data prior to imputation /EDUC_Original |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                     Associate's degree |        815       11.32       11.32
                      Bachelor's degree |      1,651       22.94       34.26
                             Don't know |         26        0.36       34.63
          High school degree or diploma |      1,359       18.88       53.51
          Less than high school diploma |        197        2.74       56.25
Post graduate work/degree or professi.. |      1,548       21.51       77.75
                   Prefer not to answer |         75        1.04       78.80
                Some college, no degree |      1,526       21.20      100.00
----------------------------------------+-----------------------------------
                                  Total |      7,197      100.00

. gen education = .
(7,197 missing values generated)

. replace education = 0 if Educationascapturedinrawsur == "Less than high school
>  diploma"
(197 real changes made)

. replace education = 1 if Educationascapturedinrawsur == "High school degree or
>  diploma"
(1,359 real changes made)

. replace education = 2 if Educationascapturedinrawsur == "Some college, no degr
> ee"
(1,526 real changes made)

. replace education = 3 if Educationascapturedinrawsur == "Associate's degree"
(815 real changes made)

. replace education = 4 if Educationascapturedinrawsur == "Bachelor's degree"
(1,651 real changes made)

. replace education = 5 if Educationascapturedinrawsur == "Post graduate work/de
> gree or professional degree"
(1,548 real changes made)

. replace education = . if Educationascapturedinrawsur == "Don't know"
(0 real changes made)

. replace education = . if Educationascapturedinrawsur == "Prefer not to answer"
(0 real changes made)

. 
. label define Education_label ///
>         0 "Less than high school diploma" ///
>         1 "High school degree or diploma" ///
>         2 "Some college, no degree" ///
>         3 "Associate's degree" ///
>         4 "Bachelor's degree" ///
>         5 "Post graduate work/degree or professional degree" 

. label values education Education_label

. label var education "Education level"

. tab Educationascapturedinrawsur education, m

Education as captured |
   in raw survey data |
  prior to imputation |               Education level
       /EDUC_Original | Less than  High scho  Some coll  Associate |     Total
----------------------+--------------------------------------------+----------
   Associate's degree |         0          0          0        815 |       815 
    Bachelor's degree |         0          0          0          0 |     1,651 
           Don't know |         0          0          0          0 |        26 
High school degree .. |         0      1,359          0          0 |     1,359 
Less than high scho.. |       197          0          0          0 |       197 
Post graduate work/.. |         0          0          0          0 |     1,548 
 Prefer not to answer |         0          0          0          0 |        75 
Some college, no de.. |         0          0      1,526          0 |     1,526 
----------------------+--------------------------------------------+----------
                Total |       197      1,359      1,526        815 |     7,197 


Education as captured |
   in raw survey data |
  prior to imputation |         Education level
       /EDUC_Original | Bachelor'  Post grad          . |     Total
----------------------+---------------------------------+----------
   Associate's degree |         0          0          0 |       815 
    Bachelor's degree |     1,651          0          0 |     1,651 
           Don't know |         0          0         26 |        26 
High school degree .. |         0          0          0 |     1,359 
Less than high scho.. |         0          0          0 |       197 
Post graduate work/.. |         0      1,548          0 |     1,548 
 Prefer not to answer |         0          0         75 |        75 
Some college, no de.. |         0          0          0 |     1,526 
----------------------+---------------------------------+----------
                Total |     1,651      1,548        101 |     7,197 

. 
. 
. //MALE
. gen male = .
(7,197 missing values generated)

. replace male = 0 if ///
>         Genderascapturedinrawsurvey == "Female" | ///
>         Genderascapturedinrawsurvey == "Non-binary / third gender" | ///
>         Genderascapturedinrawsurvey == "I use another term (specify): " 
(3,877 real changes made)

. replace male = 1 if Genderascapturedinrawsurvey == "Male"
(3,206 real changes made)

. replace male = . if ///
>         Genderascapturedinrawsurvey == "Don't know" | ///
>         Genderascapturedinrawsurvey == "Prefer not to answer"
(0 real changes made)

. 
. label define Male_label 0 "Not male" 1 Male

. label values male Male_label

. tab Genderascapturedinrawsurvey male, m

Gender as captured in |
raw survey data prior |
        to imputation |               male
     /GENDER_Original |  Not male       Male          . |     Total
----------------------+---------------------------------+----------
           Don't know |         0          0         71 |        71 
               Female |     3,812          0          0 |     3,812 
I use another term .. |         0          0          9 |         9 
                 Male |         0      3,206          0 |     3,206 
Non-binary / third .. |        65          0          0 |        65 
 Prefer not to answer |         0          0         34 |        34 
----------------------+---------------------------------+----------
                Total |     3,877      3,206        114 |     7,197 

. 
. 
. gen woman_nb = .
(7,197 missing values generated)

. replace woman_nb = 0 if Genderascapturedinrawsurvey == "Male"
(3,206 real changes made)

. replace woman_nb = 1 if ///
>         Genderascapturedinrawsurvey == "Female" | ///
>         Genderascapturedinrawsurvey== "Non-binary / third gender" | ///
>         Genderascapturedinrawsurvey == "I use another term (specify):" 
(3,886 real changes made)

. replace woman_nb = . if ///
>         Genderascapturedinrawsurvey == "Don't know" | ///
>         Genderascapturedinrawsurvey == "Prefer not to answer"
(0 real changes made)

. label define woman_nb 0 "Man" 1 "Woman/non-binary/third gender/other"

. 
. label values woman_nb woman_nb

. label var woman_nb "Woman/non-binary/other"

. tab woman_nb Genderascapturedinrawsurvey, m

                      | Gender as captured in raw survey data prior
Woman/non-binary/othe |       to imputation /GENDER_Original
                    r | Don't k..     Female  I use a..       Male |     Total
----------------------+--------------------------------------------+----------
                  Man |         0          0          0      3,206 |     3,206 
Woman/non-binary/thir |         0      3,812          9          0 |     3,886 
                    . |        71          0          0          0 |       105 
----------------------+--------------------------------------------+----------
                Total |        71      3,812          9      3,206 |     7,197 


                      | Gender as captured in
                      | raw survey data prior
                      |     to imputation
Woman/non-binary/othe |   /GENDER_Original
                    r | Non-bin..  Prefer .. |     Total
----------------------+----------------------+----------
                  Man |         0          0 |     3,206 
Woman/non-binary/thir |        65          0 |     3,886 
                    . |         0         34 |       105 
----------------------+----------------------+----------
                Total |        65         34 |     7,197 

. 
. 
. //NEW_DISASTER_EXPERIENCE
. gen new_disaster_experience = .
(7,197 missing values generated)

. replace new_disaster_experience = 0 if GENEXP1Haveyouoryourfamily == "No"
(2,819 real changes made)

. replace new_disaster_experience = 1 if GENEXP1Haveyouoryourfamily == "Yes"
(4,100 real changes made)

. replace new_disaster_experience = . if GENEXP1Haveyouoryourfamily == "Don't kn
> ow"
(0 real changes made)

. replace new_disaster_experience = . if GENEXP1Haveyouoryourfamily == "Prefer n
> ot to answer"
(0 real changes made)

. 
. label define new_disaster_experience_label 0 No 1 Yes 

. label values new_disaster_experience new_disaster_experience_label

. label var new_disaster_experience "Disaster Experience"

. tab GENEXP1Haveyouoryourfamily new_disaster_experience, m

GENEXP1  Have you or |
    your family ever |
     experienced the |
        impacts of a |       Disaster Experience
       disaster? /GE |        No        Yes          . |     Total
---------------------+---------------------------------+----------
          Don't know |         0          0        266 |       266 
                  No |     2,819          0          0 |     2,819 
Prefer not to answer |         0          0         12 |        12 
                 Yes |         0      4,100          0 |     4,100 
---------------------+---------------------------------+----------
               Total |     2,819      4,100        278 |     7,197 

. 
. //AGE
. gen age = .
(7,197 missing values generated)

. replace age = 0 if QNS6WhatisyourageAGE == "18-29"
(1,475 real changes made)

. replace age = 1 if QNS6WhatisyourageAGE == "30-39"
(1,444 real changes made)

. replace age = 2 if QNS6WhatisyourageAGE == "40-49"
(1,133 real changes made)

. replace age = 3 if QNS6WhatisyourageAGE == "50-59"
(1,158 real changes made)

. replace age = 4 if QNS6WhatisyourageAGE == "60-69"
(1,177 real changes made)

. replace age = 5 if QNS6WhatisyourageAGE == "70-79"
(684 real changes made)

. replace age = 6 if QNS6WhatisyourageAGE == "Over 80"
(126 real changes made)

. 
. label define Age_label 0 "18-29" 1 "30-39" 2 "40-49" 3 "50-59" 4 "60-69" 5 "70
> -79" 6 "Over 80"

. label values age Age_label

. label var age "Age"

. tab QNS6WhatisyourageAGE age, m

QNS6  What |
   is your |                          Age
 age? /AGE |     18-29      30-39      40-49      50-59      60-69 |     Total
-----------+-------------------------------------------------------+----------
     18-29 |     1,475          0          0          0          0 |     1,475 
     30-39 |         0      1,444          0          0          0 |     1,444 
     40-49 |         0          0      1,133          0          0 |     1,133 
     50-59 |         0          0          0      1,158          0 |     1,158 
     60-69 |         0          0          0          0      1,177 |     1,177 
     70-79 |         0          0          0          0          0 |       684 
   Over 80 |         0          0          0          0          0 |       126 
-----------+-------------------------------------------------------+----------
     Total |     1,475      1,444      1,133      1,158      1,177 |     7,197 


QNS6  What |
   is your |          Age
 age? /AGE |     70-79    Over 80 |     Total
-----------+----------------------+----------
     18-29 |         0          0 |     1,475 
     30-39 |         0          0 |     1,444 
     40-49 |         0          0 |     1,133 
     50-59 |         0          0 |     1,158 
     60-69 |         0          0 |     1,177 
     70-79 |       684          0 |       684 
   Over 80 |         0        126 |       126 
-----------+----------------------+----------
     Total |       684        126 |     7,197 

. 
. //INSURANCE_OWNERSHIP
. //insurance recode
. gen insurance = .
(7,197 missing values generated)

. replace insurance = 0 if FP1Doyouhavehomeownersorr == "No"
(1,763 real changes made)

. replace insurance = 1 if FP1Doyouhavehomeownersorr == "Yes"
(5,079 real changes made)

. replace insurance = . if FP1Doyouhavehomeownersorr == "Prefer not to answer"
(0 real changes made)

. replace insurance = . if FP1Doyouhavehomeownersorr == "Don't know"
(0 real changes made)

. 
. label define Insurance_label 0 No 1 Yes

. label values insurance Insurance_label

. label var insurance "Home insurance"

. tab FP1Doyouhavehomeownersorr insurance, m

    FP1  Do you have |
       homeowners or |
   renters insurance |
 for your residence? |          Home insurance
                /FP1 |        No        Yes          . |     Total
---------------------+---------------------------------+----------
          Don't know |         0          0        332 |       332 
                  No |     1,763          0          0 |     1,763 
Prefer not to answer |         0          0         23 |        23 
                 Yes |         0      5,079          0 |     5,079 
---------------------+---------------------------------+----------
               Total |     1,763      5,079        355 |     7,197 

. 
. //home ownership recode
. gen home_ownership = .
(7,197 missing values generated)

. replace home_ownership = 1 if D8Doyourentorownyourhome == "Own"
(4,623 real changes made)

. replace home_ownership = 0 if D8Doyourentorownyourhome == "Rent"
(2,574 real changes made)

. 
. label define Home_ownership_label 1 Own 0 Rent

. label values home_ownership Home_ownership_label

. label var home_ownership "Own / Rent Home"

. tab D8Doyourentorownyourhome home_ownership, m

D8  Do you |
   rent or |
  own your |
     home? |    Own / Rent Home
  /HOMEOWN |      Rent        Own |     Total
-----------+----------------------+----------
       Own |         0      4,623 |     4,623 
      Rent |     2,574          0 |     2,574 
-----------+----------------------+----------
     Total |     2,574      4,623 |     7,197 

. 
. //insurance_ownership recode
. gen insurance_ownership = .
(7,197 missing values generated)

. replace insurance_ownership = 1 if insurance == 1 & home_ownership == 0
(1,193 real changes made)

. replace insurance_ownership = 2 if insurance == 0 & home_ownership == 0
(1,205 real changes made)

. replace insurance_ownership = 3 if insurance == 1 & home_ownership == 1
(3,886 real changes made)

. replace insurance_ownership = 4 if insurance == 0 & home_ownership == 1
(558 real changes made)

. 
. label define Insurance_own_label ///
>         1 "Renter with insurance" ///
>         2 "Renter without insurance" ///
>         3 "Owner with insurance" ///
>         4 "Owner without insurance"

. label values insurance_ownership Insurance_own_label

. label var insurance_ownership "Rent / Own Home & Insurance"

. 
. tab insurance_ownership insurance, m

    Rent / Own Home & |          Home insurance
            Insurance |        No        Yes          . |     Total
----------------------+---------------------------------+----------
Renter with insurance |         0      1,193          0 |     1,193 
Renter without insura |     1,205          0          0 |     1,205 
 Owner with insurance |         0      3,886          0 |     3,886 
Owner without insuran |       558          0          0 |       558 
                    . |         0          0        355 |       355 
----------------------+---------------------------------+----------
                Total |     1,763      5,079        355 |     7,197 

. tab insurance_ownership home_ownership, m

    Rent / Own Home & |    Own / Rent Home
            Insurance |      Rent        Own |     Total
----------------------+----------------------+----------
Renter with insurance |     1,193          0 |     1,193 
Renter without insura |     1,205          0 |     1,205 
 Owner with insurance |         0      3,886 |     3,886 
Owner without insuran |         0        558 |       558 
                    . |       176        179 |       355 
----------------------+----------------------+----------
                Total |     2,574      4,623 |     7,197 

. 
. //MEAN_CBO
. //animal welfare
. tab CBO1Howoftendoyouuseorre

  CBO1  How often |
    do you use or |
   rely on any of |
    the following |
  community-based |
            suppo |      Freq.     Percent        Cum.
------------------+-----------------------------------
     A Great Deal |        627        8.71        8.71
A Moderate Amount |        506        7.03       15.74
            Never |      4,387       60.96       76.70
     Occasionally |        823       11.44       88.13
           Rarely |        854       11.87      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. gen animal_welfare = .
(7,197 missing values generated)

. replace animal_welfare = 0 if CBO1Howoftendoyouuseorre == "Never"
(4,387 real changes made)

. replace animal_welfare = 1 if CBO1Howoftendoyouuseorre == "Rarely"
(854 real changes made)

. replace animal_welfare = 2 if CBO1Howoftendoyouuseorre == "Occasionally"
(823 real changes made)

. replace animal_welfare = 3 if CBO1Howoftendoyouuseorre == "A Moderate Amount"
(506 real changes made)

. replace animal_welfare = 4 if CBO1Howoftendoyouuseorre == "A Great Deal"
(627 real changes made)

. 
. label define Animal_label 0 Never 1 Rarely 2 Occasionally 3 "A Moderate Amount
> " 4 "A Great Deal"

. label values animal_welfare Animal_label

. tab animal_welfare  CBO1Howoftendoyouuseorre, m

                  |  CBO1  How often do you use or rely on any
                  |   of the following community-based suppo
   animal_welfare | A Great..  A Moder..      Never  Occasio.. |     Total
------------------+--------------------------------------------+----------
            Never |         0          0      4,387          0 |     4,387 
           Rarely |         0          0          0          0 |       854 
     Occasionally |         0          0          0        823 |       823 
A Moderate Amount |         0        506          0          0 |       506 
     A Great Deal |       627          0          0          0 |       627 
------------------+--------------------------------------------+----------
            Total |       627        506      4,387        823 |     7,197 


                  | CBO1  How
                  |  often do
                  | you use or
                  |  rely on
                  | any of the
                  | following
                  | community-
                  |   based
                  |   suppo
   animal_welfare |    Rarely |     Total
------------------+-----------+----------
            Never |         0 |     4,387 
           Rarely |       854 |       854 
     Occasionally |         0 |       823 
A Moderate Amount |         0 |       506 
     A Great Deal |         0 |       627 
------------------+-----------+----------
            Total |       854 |     7,197 

. 
. //childcare
. tab CBO1_b

           CBO1_b |      Freq.     Percent        Cum.
------------------+-----------------------------------
     A Great Deal |        613        8.52        8.52
A Moderate Amount |        707        9.82       18.34
            Never |      4,602       63.94       82.28
     Occasionally |        672        9.34       91.62
           Rarely |        603        8.38      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. gen childcare = .
(7,197 missing values generated)

. replace childcare = 0 if CBO1_b == "Never"
(4,602 real changes made)

. replace childcare = 1 if CBO1_b == "Rarely"
(603 real changes made)

. replace childcare = 2 if CBO1_b == "Occasionally"
(672 real changes made)

. replace childcare = 3 if CBO1_b == "A Moderate Amount"
(707 real changes made)

. replace childcare = 4 if CBO1_b == "A Great Deal"
(613 real changes made)

. 
. label define Childcare_label 0 Never 1 Rarely 2 Occasionally 3 "A Moderate Amo
> unt" 4 "A Great Deal"

. label values childcare Childcare_label

. tab childcare

        childcare |      Freq.     Percent        Cum.
------------------+-----------------------------------
            Never |      4,602       63.94       63.94
           Rarely |        603        8.38       72.32
     Occasionally |        672        9.34       81.66
A Moderate Amount |        707        9.82       91.48
     A Great Deal |        613        8.52      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. //emergency_services
. tab CBO1_d

           CBO1_d |      Freq.     Percent        Cum.
------------------+-----------------------------------
     A Great Deal |        818       11.37       11.37
A Moderate Amount |        901       12.52       23.88
            Never |      2,399       33.33       57.22
     Occasionally |      1,177       16.35       73.57
           Rarely |      1,902       26.43      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. gen emergency_services = .
(7,197 missing values generated)

. replace emergency_services = 0 if CBO1_d == "Never"
(2,399 real changes made)

. replace emergency_services = 1 if CBO1_d == "Rarely"
(1,902 real changes made)

. replace emergency_services = 2 if CBO1_d == "Occasionally"
(1,177 real changes made)

. replace emergency_services = 3 if CBO1_d == "A Moderate Amount"
(901 real changes made)

. replace emergency_services = 4 if CBO1_d == "A Great Deal"
(818 real changes made)

. 
. label define Emergency_services_label 0 Never 1 Rarely 2 Occasionally 3 "A Mod
> erate Amount" 4 "A Great Deal"

. label values emergency_services Emergency_services_label

. tab emergency_services

emergency_service |
                s |      Freq.     Percent        Cum.
------------------+-----------------------------------
            Never |      2,399       33.33       33.33
           Rarely |      1,902       26.43       59.76
     Occasionally |      1,177       16.35       76.12
A Moderate Amount |        901       12.52       88.63
     A Great Deal |        818       11.37      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. //faith_services
. tab CBO1_e

           CBO1_e |      Freq.     Percent        Cum.
------------------+-----------------------------------
     A Great Deal |        884       12.28       12.28
A Moderate Amount |        859       11.94       24.22
            Never |      3,324       46.19       70.40
     Occasionally |      1,152       16.01       86.41
           Rarely |        978       13.59      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. gen faith_services = .
(7,197 missing values generated)

. replace faith_services = 0 if CBO1_e == "Never"
(3,324 real changes made)

. replace faith_services = 1 if CBO1_e == "Rarely"
(978 real changes made)

. replace faith_services = 2 if CBO1_e == "Occasionally"
(1,152 real changes made)

. replace faith_services = 3 if CBO1_e == "A Moderate Amount"
(859 real changes made)

. replace faith_services = 4 if CBO1_e == "A Great Deal"
(884 real changes made)

. 
. label define faith_services_label 0 Never 1 Rarely 2 Occasionally 3 "A Moderat
> e Amount" 4 "A Great Deal"

. label values faith_services faith_services_label

. tab faith_services

   faith_services |      Freq.     Percent        Cum.
------------------+-----------------------------------
            Never |      3,324       46.19       46.19
           Rarely |        978       13.59       59.77
     Occasionally |      1,152       16.01       75.78
A Moderate Amount |        859       11.94       87.72
     A Great Deal |        884       12.28      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. //financial_support
. tab CBO1_f

           CBO1_f |      Freq.     Percent        Cum.
------------------+-----------------------------------
     A Great Deal |        749       10.41       10.41
A Moderate Amount |        958       13.31       23.72
            Never |      3,289       45.70       69.42
     Occasionally |      1,060       14.73       84.15
           Rarely |      1,141       15.85      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. gen financial_support = .
(7,197 missing values generated)

. replace financial_support = 0 if CBO1_f == "Never"
(3,289 real changes made)

. replace financial_support = 1 if CBO1_f == "Rarely"
(1,141 real changes made)

. replace financial_support = 2 if CBO1_f == "Occasionally"
(1,060 real changes made)

. replace financial_support = 3 if CBO1_f == "A Moderate Amount"
(958 real changes made)

. replace financial_support = 4 if CBO1_f == "A Great Deal"
(749 real changes made)

. 
. label define financial_support_label 0 Never 1 Rarely 2 Occasionally 3 "A Mode
> rate Amount" 4 "A Great Deal"

. label values financial_support financial_support_label

. tab financial_support

financial_support |      Freq.     Percent        Cum.
------------------+-----------------------------------
            Never |      3,289       45.70       45.70
           Rarely |      1,141       15.85       61.55
     Occasionally |      1,060       14.73       76.28
A Moderate Amount |        958       13.31       89.59
     A Great Deal |        749       10.41      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. //food_pantry
. tab CBO1_g

           CBO1_g |      Freq.     Percent        Cum.
------------------+-----------------------------------
     A Great Deal |        837       11.63       11.63
A Moderate Amount |        933       12.96       24.59
            Never |      3,337       46.37       70.96
     Occasionally |      1,165       16.19       87.15
           Rarely |        925       12.85      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. gen food_pantry = .
(7,197 missing values generated)

. replace food_pantry = 0 if CBO1_g == "Never"
(3,337 real changes made)

. replace food_pantry = 1 if CBO1_g == "Rarely"
(925 real changes made)

. replace food_pantry = 2 if CBO1_g == "Occasionally"
(1,165 real changes made)

. replace food_pantry = 3 if CBO1_g == "A Moderate Amount"
(933 real changes made)

. replace food_pantry = 4 if CBO1_g == "A Great Deal"
(837 real changes made)

. 
. label define food_pantry_label 0 Never 1 Rarely 2 Occasionally 3 "A Moderate A
> mount" 4 "A Great Deal"

. label values food_pantry food_pantry_label

. tab food_pantry

      food_pantry |      Freq.     Percent        Cum.
------------------+-----------------------------------
            Never |      3,337       46.37       46.37
           Rarely |        925       12.85       59.22
     Occasionally |      1,165       16.19       75.41
A Moderate Amount |        933       12.96       88.37
     A Great Deal |        837       11.63      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. //general_services
. tab CBO1_h

           CBO1_h |      Freq.     Percent        Cum.
------------------+-----------------------------------
     A Great Deal |        633        8.80        8.80
A Moderate Amount |        883       12.27       21.06
            Never |      3,331       46.28       67.35
     Occasionally |      1,152       16.01       83.35
           Rarely |      1,198       16.65      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. gen general_services = .
(7,197 missing values generated)

. replace general_services = 0 if CBO1_h == "Never"
(3,331 real changes made)

. replace general_services = 1 if CBO1_h == "Rarely"
(1,198 real changes made)

. replace general_services = 2 if CBO1_h == "Occasionally"
(1,152 real changes made)

. replace general_services = 3 if CBO1_h == "A Moderate Amount"
(883 real changes made)

. replace general_services = 4 if CBO1_h == "A Great Deal"
(633 real changes made)

. 
. label define general_services_label 0 Never 1 Rarely 2 Occasionally 3 "A Moder
> ate Amount" 4 "A Great Deal"

. label values general_services general_services_label

. tab general_services

 general_services |      Freq.     Percent        Cum.
------------------+-----------------------------------
            Never |      3,331       46.28       46.28
           Rarely |      1,198       16.65       62.93
     Occasionally |      1,152       16.01       78.94
A Moderate Amount |        883       12.27       91.20
     A Great Deal |        633        8.80      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. //housing_support
. tab CBO1_j

           CBO1_j |      Freq.     Percent        Cum.
------------------+-----------------------------------
     A Great Deal |        770       10.70       10.70
A Moderate Amount |        839       11.66       22.36
            Never |      3,976       55.25       77.60
     Occasionally |        842       11.70       89.30
           Rarely |        770       10.70      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. gen housing_support = .
(7,197 missing values generated)

. replace housing_support = 0 if CBO1_j == "Never"
(3,976 real changes made)

. replace housing_support = 1 if CBO1_j == "Rarely"
(770 real changes made)

. replace housing_support = 2 if CBO1_j == "Occasionally"
(842 real changes made)

. replace housing_support = 3 if CBO1_j == "A Moderate Amount"
(839 real changes made)

. replace housing_support = 4 if CBO1_j == "A Great Deal"
(770 real changes made)

. 
. label define housing_support_label 0 Never 1 Rarely 2 Occasionally 3 "A Modera
> te Amount" 4 "A Great Deal"

. label values housing_support housing_support_label

. tab housing_support

  housing_support |      Freq.     Percent        Cum.
------------------+-----------------------------------
            Never |      3,976       55.25       55.25
           Rarely |        770       10.70       65.94
     Occasionally |        842       11.70       77.64
A Moderate Amount |        839       11.66       89.30
     A Great Deal |        770       10.70      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. //immigrant_support
. tab CBO1_k

           CBO1_k |      Freq.     Percent        Cum.
------------------+-----------------------------------
     A Great Deal |        568        7.89        7.89
A Moderate Amount |        601        8.35       16.24
            Never |      4,796       66.64       82.88
     Occasionally |        663        9.21       92.09
           Rarely |        569        7.91      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. gen immigrant_support = .
(7,197 missing values generated)

. replace immigrant_support = 0 if CBO1_k == "Never"
(4,796 real changes made)

. replace immigrant_support = 1 if CBO1_k == "Rarely"
(569 real changes made)

. replace immigrant_support = 2 if CBO1_k == "Occasionally"
(663 real changes made)

. replace immigrant_support = 3 if CBO1_k == "A Moderate Amount"
(601 real changes made)

. replace immigrant_support = 4 if CBO1_k == "A Great Deal"
(568 real changes made)

. 
. label define immigrant_support_label 0 Never 1 Rarely 2 Occasionally 3 "A Mode
> rate Amount" 4 "A Great Deal"

. label values immigrant_support immigrant_support_label

. tab immigrant_support

immigrant_support |      Freq.     Percent        Cum.
------------------+-----------------------------------
            Never |      4,796       66.64       66.64
           Rarely |        569        7.91       74.54
     Occasionally |        663        9.21       83.76
A Moderate Amount |        601        8.35       92.11
     A Great Deal |        568        7.89      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. //legal_aid
. tab CBO1_l

           CBO1_l |      Freq.     Percent        Cum.
------------------+-----------------------------------
     A Great Deal |        577        8.02        8.02
A Moderate Amount |        748       10.39       18.41
            Never |      4,395       61.07       79.48
     Occasionally |        735       10.21       89.69
           Rarely |        742       10.31      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. gen legal_aid = .
(7,197 missing values generated)

. replace legal_aid = 0 if CBO1_l == "Never"
(4,395 real changes made)

. replace legal_aid = 1 if CBO1_l == "Rarely"
(742 real changes made)

. replace legal_aid = 2 if CBO1_l == "Occasionally"
(735 real changes made)

. replace legal_aid = 3 if CBO1_l == "A Moderate Amount"
(748 real changes made)

. replace legal_aid = 4 if CBO1_l == "A Great Deal"
(577 real changes made)

. 
. label define legal_aid_label 0 Never 1 Rarely 2 Occasionally 3 "A Moderate Amo
> unt" 4 "A Great Deal"

. label values legal_aid legal_aid_label

. tab legal_aid

        legal_aid |      Freq.     Percent        Cum.
------------------+-----------------------------------
            Never |      4,395       61.07       61.07
           Rarely |        742       10.31       71.38
     Occasionally |        735       10.21       81.59
A Moderate Amount |        748       10.39       91.98
     A Great Deal |        577        8.02      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. //small_business
. tab CBO1_m

           CBO1_m |      Freq.     Percent        Cum.
------------------+-----------------------------------
     A Great Deal |        752       10.45       10.45
A Moderate Amount |        941       13.07       23.52
            Never |      3,417       47.48       71.00
     Occasionally |      1,184       16.45       87.45
           Rarely |        903       12.55      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. gen small_business = .
(7,197 missing values generated)

. replace small_business = 0 if CBO1_m == "Never"
(3,417 real changes made)

. replace small_business = 1 if CBO1_m == "Rarely"
(903 real changes made)

. replace small_business = 2 if CBO1_m == "Occasionally"
(1,184 real changes made)

. replace small_business = 3 if CBO1_m == "A Moderate Amount"
(941 real changes made)

. replace small_business = 4 if CBO1_m == "A Great Deal"
(752 real changes made)

. 
. label define small_business_label 0 Never 1 Rarely 2 Occasionally 3 "A Moderat
> e Amount" 4 "A Great Deal"

. label values small_business small_business_label

. tab small_business

   small_business |      Freq.     Percent        Cum.
------------------+-----------------------------------
            Never |      3,417       47.48       47.48
           Rarely |        903       12.55       60.03
     Occasionally |      1,184       16.45       76.48
A Moderate Amount |        941       13.07       89.55
     A Great Deal |        752       10.45      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. //senior_support
. tab CBO1_n

           CBO1_n |      Freq.     Percent        Cum.
------------------+-----------------------------------
     A Great Deal |        703        9.77        9.77
A Moderate Amount |        788       10.95       20.72
            Never |      3,957       54.98       75.70
     Occasionally |        923       12.82       88.52
           Rarely |        826       11.48      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. gen senior_support = .
(7,197 missing values generated)

. replace senior_support = 0 if CBO1_n == "Never"
(3,957 real changes made)

. replace senior_support = 1 if CBO1_n == "Rarely"
(826 real changes made)

. replace senior_support = 2 if CBO1_n == "Occasionally"
(923 real changes made)

. replace senior_support = 3 if CBO1_n == "A Moderate Amount"
(788 real changes made)

. replace senior_support = 4 if CBO1_n == "A Great Deal"
(703 real changes made)

. 
. label define senior_support_label 0 Never 1 Rarely 2 Occasionally 3 "A Moderat
> e Amount" 4 "A Great Deal"

. label values senior_support senior_support_label

. tab senior_support

   senior_support |      Freq.     Percent        Cum.
------------------+-----------------------------------
            Never |      3,957       54.98       54.98
           Rarely |        826       11.48       66.46
     Occasionally |        923       12.82       79.28
A Moderate Amount |        788       10.95       90.23
     A Great Deal |        703        9.77      100.00
------------------+-----------------------------------
            Total |      7,197      100.00

. 
. //mean
. gen mean_cbo = (animal_welfare + childcare + emergency_services + faith_servic
> es + financial_support + food_pantry + general_services + housing_support + im
> migrant_support + legal_aid + small_business + senior_support)/12

. sum mean_cbo, det

                          mean_cbo
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               7,197
25%     .1666667              0       Sum of wgt.       7,197

50%     .6666667                      Mean           1.130367
                        Largest       Std. dev.      1.159056
75%            2              4
90%     3.083333              4       Variance       1.343412
95%          3.5              4       Skewness       .9394095
99%            4              4       Kurtosis       2.700545

. label var mean_cbo "Mean Community Involvement"

. 
. //SIMPLE_EMPLOYMENT
. gen simple_employment = .
(7,197 missing values generated)

. replace simple_employment = 0 if ///
>         Employmentascapturedinrawsu == "No, I have been unemployed for less th
> an 1 month" | ///
>         Employmentascapturedinrawsu == "No, I have been unemployed for 1-2 mon
> ths" | ///
>         Employmentascapturedinrawsu == "No, I have been unemployed for 2-6 mon
> ths" | ///
>         Employmentascapturedinrawsu == "No, I have been unemployed for 6 month
> s - 1 year" | ///
>         Employmentascapturedinrawsu == "No, I have been unemployed for more th
> an 1 year" | ///
>         Employmentascapturedinrawsu == "Not in the labor force, and not retire
> d (e.g. student, stay-at-home spouse)" 
(1,845 real changes made)

. replace simple_employment = 1 if Employmentascapturedinrawsu == "No, I am reti
> red"
(1,564 real changes made)

. replace simple_employment = 2 if ///
>         Employmentascapturedinrawsu == "Yes" | ///
>         Employmentascapturedinrawsu == "In Armed Forces"
(3,523 real changes made)

. 
. label define Simple_employment_label 0 "Unemployed" 1 "Retired" 2 "Employed"

. label values simple_employment Simple_employment_label

. label var simple_employment "Employment Status"

. tab Employmentascapturedinrawsu simple_employment, m

        Employment as |
      captured in raw |
 survey data prior to |
           imputation |              Employment Status
     /EMPLOY_Original | Unemploye    Retired   Employed          . |     Total
----------------------+--------------------------------------------+----------
      In Armed Forces |         0          0         16          0 |        16 
     No, I am retired |         0      1,564          0          0 |     1,564 
No, I have been une.. |       152          0          0          0 |       152 
No, I have been une.. |       180          0          0          0 |       180 
No, I have been une.. |       303          0          0          0 |       303 
No, I have been une.. |       151          0          0          0 |       151 
No, I have been une.. |       565          0          0          0 |       565 
Not in the labor fo.. |       494          0          0          0 |       494 
 Prefer not to answer |         0          0          0        265 |       265 
                  Yes |         0          0      3,507          0 |     3,507 
----------------------+--------------------------------------------+----------
                Total |     1,845      1,564      3,523        265 |     7,197 

. 
. //RACE/ETHNICITY
. // Ethnicity
. tab Ethnicityafterdatacleaningpr, m nolabel

Ethnicity after data |
   cleaning prior to |
  imputation. (Value |
 labels were changed |
                  so |      Freq.     Percent        Cum.
---------------------+-----------------------------------
          Don't know |         57        0.79        0.79
     Hispanic/Latino |      1,369       19.02       19.81
        Non-Hispanic |      5,702       79.23       99.04
Prefer not to answer |         69        0.96      100.00
---------------------+-----------------------------------
               Total |      7,197      100.00

. tab Ethnicityafterdatacleaningpr, m

Ethnicity after data |
   cleaning prior to |
  imputation. (Value |
 labels were changed |
                  so |      Freq.     Percent        Cum.
---------------------+-----------------------------------
          Don't know |         57        0.79        0.79
     Hispanic/Latino |      1,369       19.02       19.81
        Non-Hispanic |      5,702       79.23       99.04
Prefer not to answer |         69        0.96      100.00
---------------------+-----------------------------------
               Total |      7,197      100.00

. 
. // Race
. tab D4Whichofthefollowingdescr, m nolabel

         D4  Which of the following |
describes your race? You may select |
                  one or more. /RAC |      Freq.     Percent        Cum.
------------------------------------+-----------------------------------
   American Indian or Alaska Native |        108        1.50        1.50
                              Asian |        355        4.93        6.43
          Black or African American |        833       11.57       18.01
Native Hawaiian or Pacific Islander |         34        0.47       18.48
                              Other |        292        4.06       22.54
                  Two or More Races |        252        3.50       26.04
                              White |      5,323       73.96      100.00
------------------------------------+-----------------------------------
                              Total |      7,197      100.00

. tab D4Whichofthefollowingdescr, m 

         D4  Which of the following |
describes your race? You may select |
                  one or more. /RAC |      Freq.     Percent        Cum.
------------------------------------+-----------------------------------
   American Indian or Alaska Native |        108        1.50        1.50
                              Asian |        355        4.93        6.43
          Black or African American |        833       11.57       18.01
Native Hawaiian or Pacific Islander |         34        0.47       18.48
                              Other |        292        4.06       22.54
                  Two or More Races |        252        3.50       26.04
                              White |      5,323       73.96      100.00
------------------------------------+-----------------------------------
                              Total |      7,197      100.00

. 
. tab D4Whichofthefollowingdescr Ethnicityafterdatacleaningp, m

     D4  Which of the |
  following describes |
   your race? You may |   Ethnicity after data cleaning prior to
  select one or more. |  imputation. (Value labels were changed so
                 /RAC | Don't k..  Hispani..  Non-His..  Prefer .. |     Total
----------------------+--------------------------------------------+----------
American Indian or .. |         2         51         51          4 |       108 
                Asian |         6         17        323          9 |       355 
Black or African Am.. |        16        147        660         10 |       833 
Native Hawaiian or .. |         0         16         17          1 |        34 
                Other |         2        242         43          5 |       292 
    Two or More Races |         2         92        157          1 |       252 
                White |        29        804      4,451         39 |     5,323 
----------------------+--------------------------------------------+----------
                Total |        57      1,369      5,702         69 |     7,197 

. 
. ** Modified version of the combined race specification: insufficient sample si
> ze of Native Hawaiian / Pacific Islander and  American Indian/Alaska Native, s
> o added to "Other", otherwise follow:
. *"combined race (a more detailed scheme that also separated out Pacific Island
> -origin and multiple race respondents)"
. * "pentagon race (which includes five categories distinguishing American India
> n, Asian, Black, Hispanic, and White respondents)"
. *Combined Race based on Howell & Emerson 2017: https://journals.sagepub.com/do
> i/10.1177/2332649216648465
. 
. gen race_ethnicity = .
(7,197 missing values generated)

. replace race_ethnicity = 0 if D4Whichofthefollowingdescr == "White" &  ///
>         D4Whichofthefollowingdescr != "Black or African American" & ///
>         D4Whichofthefollowingdescr != "Asian" & ///
>         Ethnicityafterdatacleaningpr != "Hispanic/Latino" & ///
>         D4Whichofthefollowingdescr != "Native Hawaiian or Pacific Islander" & 
> ///
>         D4Whichofthefollowingdescr != "American Indian or Alaska Native" & ///
>         D4Whichofthefollowingdescr != "Other"
(4,519 real changes made)

.         
. replace race_ethnicity = 1 if D4Whichofthefollowingdescr == "Black or African 
> American" & ///
>         D4Whichofthefollowingdescr != "White" & ///
>         D4Whichofthefollowingdescr != "Asian" & ///
>         Ethnicityafterdatacleaningpr != "Hispanic/Latino" & ///
>         D4Whichofthefollowingdescr != "Native Hawaiian or Pacific Islander" & 
> ///
>         D4Whichofthefollowingdescr != "American Indian or Alaska Native" & ///
>         D4Whichofthefollowingdescr != "Other"
(686 real changes made)

.         
. replace race_ethnicity = 2 if D4Whichofthefollowingdescr == "Asian" & ///
>         D4Whichofthefollowingdescr != "Black or African American" & ///
>         D4Whichofthefollowingdescr != "White" & ///
>         Ethnicityafterdatacleaningpr != "Hispanic/Latino" & ///
>         D4Whichofthefollowingdescr != "Native Hawaiian or Pacific Islander" & 
> ///
>         D4Whichofthefollowingdescr != "American Indian or Alaska Native" & ///
>         D4Whichofthefollowingdescr != "Other"
(338 real changes made)

.         
. *"Hispanic origin responses efectively override race responses (as in combined
>  race and pentagon)" (Guluma and Saperstein 2022)
. replace race_ethnicity = 3 if Ethnicityafterdatacleaningpr == "Hispanic/Latino
> " 
(1,369 real changes made)

. 
. replace race_ethnicity = 4 if ///
>         D4Whichofthefollowingdescr == "Other" | ///
>         D4Whichofthefollowingdescr == "Native Hawaiian or Pacific Islander" | 
> ///
>         D4Whichofthefollowingdescr == "American Indian or Alaska Native" & ///
>         D4Whichofthefollowingdescr != "Black or African American" & ///
>         D4Whichofthefollowingdescr != "Asian" & ///
>         D4Whichofthefollowingdescr != "White" & ///
>         D4Whichofthefollowingdescr != "Native Hawaiian or Pacific Islander" & 
> ///
>         D4Whichofthefollowingdescr != "American Indian or Alaska Native" & ///
>         D4Whichofthefollowingdescr != "White" 
(326 real changes made)

. 
. *Two or more
. replace race_ethnicity = 5 if D4Whichofthefollowingdescr == "Two or More Races
> " 
(252 real changes made)

. 
. replace race_ethnicity = 4 if race_ethnicity == .
(57 real changes made)

. 
. label define race_ethnicity_label ///
>         0 "White (non-Hispanic)" ///
>         1 "Black or African American" ///
>         2 "Asian" ///
>         3 "Hispanic/Latino" ///
>         4 "Other" ///
>         5 "Multiple"

. label values  race_ethnicity race_ethnicity_label

. label var race_ethnicity "Race / Ethnicity"

. 
. tab race_ethnicity, m

         Race / Ethnicity |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
     White (non-Hispanic) |      4,519       62.79       62.79
Black or African American |        686        9.53       72.32
                    Asian |        338        4.70       77.02
          Hispanic/Latino |      1,019       14.16       91.18
                    Other |        383        5.32       96.50
                 Multiple |        252        3.50      100.00
--------------------------+-----------------------------------
                    Total |      7,197      100.00

. tab race_ethnicity, m nolabel

     Race / |
  Ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,519       62.79       62.79
          1 |        686        9.53       72.32
          2 |        338        4.70       77.02
          3 |      1,019       14.16       91.18
          4 |        383        5.32       96.50
          5 |        252        3.50      100.00
------------+-----------------------------------
      Total |      7,197      100.00

. tab race race_ethnicity, m

                      |              Race / Ethnicity
     Race / Ethnicity | White (no  Black or       Asian  Hispanic/ |     Total
----------------------+--------------------------------------------+----------
 White (non-Hispanic) |     4,519          0          0          0 |     4,519 
Black or African Amer |         0        686          0          0 |       686 
                Asian |         0          0        338          0 |       338 
      Hispanic/Latino |         0          0          0      1,019 |     1,019 
                Other |         0          0          0          0 |       383 
             Multiple |         0          0          0          0 |       252 
----------------------+--------------------------------------------+----------
                Total |     4,519        686        338      1,019 |     7,197 


                      |   Race / Ethnicity
     Race / Ethnicity |     Other   Multiple |     Total
----------------------+----------------------+----------
 White (non-Hispanic) |         0          0 |     4,519 
Black or African Amer |         0          0 |       686 
                Asian |         0          0 |       338 
      Hispanic/Latino |         0          0 |     1,019 
                Other |       383          0 |       383 
             Multiple |         0        252 |       252 
----------------------+----------------------+----------
                Total |       383        252 |     7,197 

. 
. tab D4Whichofthefollowingdescr race_ethnicity, m

     D4  Which of the |
  following describes |
   your race? You may |
  select one or more. |              Race / Ethnicity
                 /RAC | White (no  Black or       Asian  Hispanic/ |     Total
----------------------+--------------------------------------------+----------
American Indian or .. |         0          0          0         51 |       108 
                Asian |         0          0        338         17 |       355 
Black or African Am.. |         0        686          0        147 |       833 
Native Hawaiian or .. |         0          0          0          0 |        34 
                Other |         0          0          0          0 |       292 
    Two or More Races |         0          0          0          0 |       252 
                White |     4,519          0          0        804 |     5,323 
----------------------+--------------------------------------------+----------
                Total |     4,519        686        338      1,019 |     7,197 


     D4  Which of the |
  following describes |
   your race? You may |
  select one or more. |   Race / Ethnicity
                 /RAC |     Other   Multiple |     Total
----------------------+----------------------+----------
American Indian or .. |        57          0 |       108 
                Asian |         0          0 |       355 
Black or African Am.. |         0          0 |       833 
Native Hawaiian or .. |        34          0 |        34 
                Other |       292          0 |       292 
    Two or More Races |         0        252 |       252 
                White |         0          0 |     5,323 
----------------------+----------------------+----------
                Total |       383        252 |     7,197 

. tab Ethnicityafterdatacleaningpr race_ethnicity, m

Ethnicity after data |
   cleaning prior to |
  imputation. (Value |
 labels were changed |              Race / Ethnicity
                  so | White (no  Black or       Asian  Hispanic/ |     Total
---------------------+--------------------------------------------+----------
          Don't know |        29         16          6          0 |        57 
     Hispanic/Latino |         0          0          0      1,019 |     1,369 
        Non-Hispanic |     4,451        660        323          0 |     5,702 
Prefer not to answer |        39         10          9          0 |        69 
---------------------+--------------------------------------------+----------
               Total |     4,519        686        338      1,019 |     7,197 


Ethnicity after data |
   cleaning prior to |
  imputation. (Value |
 labels were changed |   Race / Ethnicity
                  so |     Other   Multiple |     Total
---------------------+----------------------+----------
          Don't know |         4          2 |        57 
     Hispanic/Latino |       258         92 |     1,369 
        Non-Hispanic |       111        157 |     5,702 
Prefer not to answer |        10          1 |        69 
---------------------+----------------------+----------
               Total |       383        252 |     7,197 

. 
. ***--------------------------***
. // VARIABLES OF INTEREST
. ***--------------------------***
. //CONFIDENCE_PREP
. gen confidence_prep = . 
(7,197 missing values generated)

. replace confidence_prep = 0 if C2Howconfidentareyouthaty == "Not at all confid
> ent"
(220 real changes made)

. replace confidence_prep = 1 if C2Howconfidentareyouthaty == "Slightly confiden
> t"
(869 real changes made)

. replace confidence_prep = 2 if C2Howconfidentareyouthaty == "Somewhat confiden
> t"
(1,904 real changes made)

. replace confidence_prep = 3 if C2Howconfidentareyouthaty == "Moderately confid
> ent"
(2,243 real changes made)

. replace confidence_prep = 4 if C2Howconfidentareyouthaty == "Extremely confide
> nt"
(1,775 real changes made)

. replace confidence_prep = . if C2Howconfidentareyouthaty ==  "Don't know" | //
> /
>                                                            C2Howconfidentareyo
> uthaty == "Prefer not to answer"
(0 real changes made)

.                                                            
. label define confidence_rev_label ///
>         0 "Not at all confident" ///
>         1 "Slightly confident" ///
>         2 "Somewhat confident" ///
>         3 "Moderately confident" ///
>         4 "Extremely confident" 

. label values confidence_prep confidence_rev_label

. label var confidence_prep "Confidence level"

. tab confidence_prep, m

    Confidence level |      Freq.     Percent        Cum.
---------------------+-----------------------------------
Not at all confident |        220        3.06        3.06
  Slightly confident |        869       12.07       15.13
  Somewhat confident |      1,904       26.46       41.59
Moderately confident |      2,243       31.17       72.75
 Extremely confident |      1,775       24.66       97.42
                   . |        186        2.58      100.00
---------------------+-----------------------------------
               Total |      7,197      100.00

. 
. 
. //Confidence recode for histograms
. tab confidence_prep, m

    Confidence level |      Freq.     Percent        Cum.
---------------------+-----------------------------------
Not at all confident |        220        3.06        3.06
  Slightly confident |        869       12.07       15.13
  Somewhat confident |      1,904       26.46       41.59
Moderately confident |      2,243       31.17       72.75
 Extremely confident |      1,775       24.66       97.42
                   . |        186        2.58      100.00
---------------------+-----------------------------------
               Total |      7,197      100.00

. tab confidence_prep, m nolab

 Confidence |
      level |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        220        3.06        3.06
          1 |        869       12.07       15.13
          2 |      1,904       26.46       41.59
          3 |      2,243       31.17       72.75
          4 |      1,775       24.66       97.42
          . |        186        2.58      100.00
------------+-----------------------------------
      Total |      7,197      100.00

. 
. gen extremely_conf = .
(7,197 missing values generated)

. replace extremely_conf = 1 if confidence_prep == 4
(1,775 real changes made)

. label define Extremely_conf 1 "Extremely confident"

. label values extremely_conf Extremely_conf

. tab extremely_conf

     extremely_conf |      Freq.     Percent        Cum.
--------------------+-----------------------------------
Extremely confident |      1,775      100.00      100.00
--------------------+-----------------------------------
              Total |      1,775      100.00

. 
. gen moderate_conf = .
(7,197 missing values generated)

. replace moderate_conf = 1 if confidence_prep == 3
(2,243 real changes made)

. label define Moderate_conf 1 "Moderately confident"

. label values moderate_conf Moderate_conf

. tab moderate_conf

       moderate_conf |      Freq.     Percent        Cum.
---------------------+-----------------------------------
Moderately confident |      2,243      100.00      100.00
---------------------+-----------------------------------
               Total |      2,243      100.00

. 
. gen somewhat_conf = .
(7,197 missing values generated)

. replace somewhat_conf = 1 if confidence_prep == 2
(1,904 real changes made)

. label define Somewhat_conf 1 "Somewhat confident"

. label values somewhat_conf Somewhat_conf

. tab somewhat_conf

     somewhat_conf |      Freq.     Percent        Cum.
-------------------+-----------------------------------
Somewhat confident |      1,904      100.00      100.00
-------------------+-----------------------------------
             Total |      1,904      100.00

. 
. gen slightly_conf = .
(7,197 missing values generated)

. replace slightly_conf = 1 if confidence_prep == 1
(869 real changes made)

. label define Slightly_conf 1 "Slightly confident"

. label values slightly_conf Slightly_conf

. tab slightly_conf

     slightly_conf |      Freq.     Percent        Cum.
-------------------+-----------------------------------
Slightly confident |        869      100.00      100.00
-------------------+-----------------------------------
             Total |        869      100.00

. 
. gen not_conf = .
(7,197 missing values generated)

. replace not_conf = 1 if confidence_prep == 0
(220 real changes made)

. label define Not_conf 1 "Not at all confident"

. label values not_conf Not_conf

. tab not_conf

            not_conf |      Freq.     Percent        Cum.
---------------------+-----------------------------------
Not at all confident |        220      100.00      100.00
---------------------+-----------------------------------
               Total |        220      100.00

. 
. 
. //MEAN_INFO
. //alerts and warnings
. tab A3Inthepastyearwhatinfor, m

     A3  In the past year, what |
     information have you read, |
     seen, or heard about how t |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                                |      3,452       47.96       47.96
Sign up for Alerts and Warnings |      3,745       52.04      100.00
--------------------------------+-----------------------------------
                          Total |      7,197      100.00

. 
. gen info_alerts_warnings = .
(7,197 missing values generated)

. replace info_alerts_warnings = 0 
(7,197 real changes made)

. replace info_alerts_warnings = 1 if A3Inthepastyearwhatinfor == "Sign up for A
> lerts and Warnings"
(3,745 real changes made)

. 
. label define Info_alerts_warnings 0 No 1 "Sign up for Alerts and Warnings"

. label values info_alerts_warnings Info_alerts_warnings

. tab info_alerts_warnings A3Inthepastyearwhatinfor, m

                      | A3  In the past year,
                      | what information have
                      |  you read, seen, or
                      |   heard about how t
 info_alerts_warnings |            Sign up.. |     Total
----------------------+----------------------+----------
                   No |     3,452          0 |     3,452 
Sign up for Alerts an |         0      3,745 |     3,745 
----------------------+----------------------+----------
                Total |     3,452      3,745 |     7,197 

. 
. //make a plan
. tab A3_B, m

       A3_B |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      3,182       44.21       44.21
Make a Plan |      4,015       55.79      100.00
------------+-----------------------------------
      Total |      7,197      100.00

. 
. gen info_plan = .
(7,197 missing values generated)

. replace info_plan = 0 
(7,197 real changes made)

. replace info_plan = 1 if A3_B == "Make a Plan"
(4,015 real changes made)

. 
. label define Info_plan 0 No 1 "Make a Plan"

. label values info_plan Info_plan

. tab info_plan A3_B, m

            |         A3_B
  info_plan |            Make a .. |     Total
------------+----------------------+----------
         No |     3,182          0 |     3,182 
Make a Plan |         0      4,015 |     4,015 
------------+----------------------+----------
      Total |     3,182      4,015 |     7,197 

. 
. //save for rainy day
. tab A3_C, m

                A3_C |      Freq.     Percent        Cum.
---------------------+-----------------------------------
                     |      3,714       51.60       51.60
Save for a Rainy Day |      3,483       48.40      100.00
---------------------+-----------------------------------
               Total |      7,197      100.00

. 
. gen info_save = .
(7,197 missing values generated)

. replace info_save = 0 
(7,197 real changes made)

. replace info_save = 1 if A3_C == "Save for a Rainy Day"
(3,483 real changes made)

. 
. label define Info_save 0 No 1 "Save for a Rainy Day"

. label values info_save Info_save

. tab info_save A3_C, m

                     |         A3_C
           info_save |            Save fo.. |     Total
---------------------+----------------------+----------
                  No |     3,714          0 |     3,714 
Save for a Rainy Day |         0      3,483 |     3,483 
---------------------+----------------------+----------
               Total |     3,714      3,483 |     7,197 

. 
. //emergency Drills
. tab A3_D, m

                               A3_D |      Freq.     Percent        Cum.
------------------------------------+-----------------------------------
                                    |      5,018       69.72       69.72
Practice Emergency Drills or Habits |      2,179       30.28      100.00
------------------------------------+-----------------------------------
                              Total |      7,197      100.00

. 
. gen info_emergency_drills = .
(7,197 missing values generated)

. replace info_emergency_drills = 0 
(7,197 real changes made)

. replace info_emergency_drills = 1 if A3_D == "Practice Emergency Drills or Hab
> its"
(2,179 real changes made)

. 
. label define info_emergency_drills 0 No 1 "Practice Emergency Drills or Habits
> "

. label values info_emergency_drills info_emergency_drills

. tab info_emergency_drills A3_D, m

                      |         A3_D
info_emergency_drills |            Practic.. |     Total
----------------------+----------------------+----------
                   No |     5,018          0 |     5,018 
Practice Emergency Dr |         0      2,179 |     2,179 
----------------------+----------------------+----------
                Total |     5,018      2,179 |     7,197 

. 
. //family Communication
. tab A3_E, m

                          A3_E |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
                               |      5,114       71.06       71.06
Test Family Communication Plan |      2,083       28.94      100.00
-------------------------------+-----------------------------------
                         Total |      7,197      100.00

. 
. gen info_communication = .
(7,197 missing values generated)

. replace info_communication = 0 
(7,197 real changes made)

. replace info_communication = 1 if A3_E == "Test Family Communication Plan"
(2,083 real changes made)

. 
. label define info_communication 0 No 1 "Test Family Communication Plan"

. label values info_communication info_communication

. tab info_communication  A3_E, m

                      |         A3_E
   info_communication |            Test Fa.. |     Total
----------------------+----------------------+----------
                   No |     5,114          0 |     5,114 
Test Family Communica |         0      2,083 |     2,083 
----------------------+----------------------+----------
                Total |     5,114      2,083 |     7,197 

. 
. //safeguard Documents
. tab A3_F, m

               A3_F |      Freq.     Percent        Cum.
--------------------+-----------------------------------
                    |      4,214       58.55       58.55
Safeguard Documents |      2,983       41.45      100.00
--------------------+-----------------------------------
              Total |      7,197      100.00

. 
. gen info_documents = .
(7,197 missing values generated)

. replace info_documents = 0 
(7,197 real changes made)

. replace info_documents = 1 if A3_F == "Safeguard Documents"
(2,983 real changes made)

. 
. label define info_documents 0 No 1 "Safeguard Documents"

. label values info_documents info_documents

. tab info_documents A3_F, m

                    |         A3_F
     info_documents |            Safegua.. |     Total
--------------------+----------------------+----------
                 No |     4,214          0 |     4,214 
Safeguard Documents |         0      2,983 |     2,983 
--------------------+----------------------+----------
              Total |     4,214      2,983 |     7,197 

. 
. //plan with neighbors
. tab A3_G, m

               A3_G |      Freq.     Percent        Cum.
--------------------+-----------------------------------
                    |      5,779       80.30       80.30
Plan with Neighbors |      1,418       19.70      100.00
--------------------+-----------------------------------
              Total |      7,197      100.00

. 
. gen info_neighbors = .
(7,197 missing values generated)

. replace info_neighbors = 0 
(7,197 real changes made)

. replace info_neighbors = 1 if A3_G == "Plan with Neighbors"
(1,418 real changes made)

. 
. label define info_neighbors 0 No 1 "Plan with Neighbors"

. label values info_neighbors info_neighbors

. tab info_neighbors  A3_G, m

                    |         A3_G
     info_neighbors |            Plan wi.. |     Total
--------------------+----------------------+----------
                 No |     5,779          0 |     5,779 
Plan with Neighbors |         0      1,418 |     1,418 
--------------------+----------------------+----------
              Total |     5,779      1,418 |     7,197 

. 
. //assemble/Update Supplies
. tab A3_H, m 

                       A3_H |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
                            |      4,016       55.80       55.80
Assemble or Update Supplies |      3,181       44.20      100.00
----------------------------+-----------------------------------
                      Total |      7,197      100.00

. 
. gen info_supplies = .
(7,197 missing values generated)

. replace info_supplies = 0 
(7,197 real changes made)

. replace info_supplies = 1 if A3_H == "Assemble or Update Supplies"
(3,181 real changes made)

. 
. label define info_supplies 0 No 1 "Assemble or Update Supplies"

. label values info_supplies info_supplies

. tab info_supplies A3_H, m

                      |         A3_H
        info_supplies |            Assembl.. |     Total
----------------------+----------------------+----------
                   No |     4,016          0 |     4,016 
Assemble or Update Su |         0      3,181 |     3,181 
----------------------+----------------------+----------
                Total |     4,016      3,181 |     7,197 

. 
. //involved in Community
. tab A3_I, m

                          A3_I |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
                               |      5,865       81.49       81.49
Get Involved in Your Community |      1,332       18.51      100.00
-------------------------------+-----------------------------------
                         Total |      7,197      100.00

. 
. gen info_involved = .
(7,197 missing values generated)

. replace info_involved = 0 
(7,197 real changes made)

. replace info_involved = 1 if A3_I == "Get Involved in Your Community"
(1,332 real changes made)

. 
. label define info_involved 0 No 1 "Get Involved in Your Community"

. label values info_involved info_involved

. tab info_involved A3_I, m

                      |         A3_I
        info_involved |            Get Inv.. |     Total
----------------------+----------------------+----------
                   No |     5,865          0 |     5,865 
Get Involved in Your  |         0      1,332 |     1,332 
----------------------+----------------------+----------
                Total |     5,865      1,332 |     7,197 

. 
. //make home safer
. tab A3_J, m

                A3_J |      Freq.     Percent        Cum.
---------------------+-----------------------------------
                     |      3,839       53.34       53.34
Make Your Home Safer |      3,358       46.66      100.00
---------------------+-----------------------------------
               Total |      7,197      100.00

. 
. gen info_home_safer = .
(7,197 missing values generated)

. replace info_home_safer = 0 
(7,197 real changes made)

. replace info_home_safer = 1 if A3_J == "Make Your Home Safer"
(3,358 real changes made)

. 
. label define info_home_safer 0 No 1 "Make Your Home Safer"

. label values info_home_safer info_home_safer

. tab info_home_safer A3_J, m

                     |         A3_J
     info_home_safer |            Make Yo.. |     Total
---------------------+----------------------+----------
                  No |     3,839          0 |     3,839 
Make Your Home Safer |         0      3,358 |     3,358 
---------------------+----------------------+----------
               Total |     3,839      3,358 |     7,197 

. 
. //know evacuation routes
. tab A3_K, m

                  A3_K |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                       |      4,063       56.45       56.45
Know Evacuation Routes |      3,134       43.55      100.00
-----------------------+-----------------------------------
                 Total |      7,197      100.00

. 
. gen info_evacuation = .
(7,197 missing values generated)

. replace info_evacuation = 0 
(7,197 real changes made)

. replace info_evacuation = 1 if A3_K == "Know Evacuation Routes"
(3,134 real changes made)

. 
. label define info_evacuation 0 No 1 "Know Evacuation Routes"

. label values info_evacuation info_evacuation

. tab info_evacuation A3_K, m

                      |         A3_K
      info_evacuation |            Know Ev.. |     Total
----------------------+----------------------+----------
                   No |     4,063          0 |     4,063 
Know Evacuation Route |         0      3,134 |     3,134 
----------------------+----------------------+----------
                Total |     4,063      3,134 |     7,197 

. 
. //document and insure property
. tab A3_L, m

                        A3_L |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                             |      4,732       65.75       65.75
Document and Insure Property |      2,465       34.25      100.00
-----------------------------+-----------------------------------
                       Total |      7,197      100.00

. 
. gen info_insure_property = .
(7,197 missing values generated)

. replace info_insure_property = 0 
(7,197 real changes made)

. replace info_insure_property = 1 if A3_L == "Document and Insure Property"
(2,465 real changes made)

. 
. label define info_insure_property 0 No 1 "Document and Insure Property"

. label values info_insure_property info_insure_property

. tab info_insure_property A3_L, m

                      |         A3_L
 info_insure_property |            Documen.. |     Total
----------------------+----------------------+----------
                   No |     4,732          0 |     4,732 
Document and Insure P |         0      2,465 |     2,465 
----------------------+----------------------+----------
                Total |     4,732      2,465 |     7,197 

. 
. //mean info
. gen mean_info = (info_alerts_warnings + info_plan + info_save + info_emergency
> _drills + info_communication + info_documents + info_neighbors + info_supplies
>  + info_involved + info_home_safer + info_evacuation + info_insure_property)/1
> 2

. label var mean_info "Mean information"

. sum mean_info, det

                      Mean information
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%     .0833333              0       Obs               7,197
25%     .1666667              0       Sum of wgt.       7,197

50%     .3333333                      Mean           .3864573
                        Largest       Std. dev.      .2674439
75%     .5833333              1
90%          .75              1       Variance       .0715262
95%     .9166667              1       Skewness       .4924748
99%            1              1       Kurtosis       2.490559

. 
. 
. //PREPAREDNESS_STAGE
. tab ST_STG1Thinkingaboutpreparing, m

       ST_STG1 Thinking about preparing |
  yourself for a disaster, which of the |
                              following |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                             Don't know |        375        5.21        5.21
I am NOT prepared, and I do not inten.. |        812       11.28       16.49
I am NOT prepared, but I intend to ge.. |      1,523       21.16       37.65
I am NOT prepared, but I intend to st.. |      1,247       17.33       54.98
I have been prepared for MORE than a .. |      1,576       21.90       76.88
 I have been prepared for the last year |      1,652       22.95       99.83
                   Prefer not to answer |         12        0.17      100.00
----------------------------------------+-----------------------------------
                                  Total |      7,197      100.00

. gen preparedness_stage = .
(7,197 missing values generated)

. replace preparedness_stage = 0 if ST_STG1Thinkingaboutpreparing == "I am NOT p
> repared, and I do not intend to prepare in the next year"
(812 real changes made)

. replace preparedness_stage = 1 if ST_STG1Thinkingaboutpreparing == "I am NOT p
> repared, but I intend to start preparing in the next year"
(1,247 real changes made)

. replace preparedness_stage = 2 if ST_STG1Thinkingaboutpreparing == "I am NOT p
> repared, but I intend to get prepared in the next six months"
(1,523 real changes made)

. replace preparedness_stage = 3 if ST_STG1Thinkingaboutpreparing == "I have bee
> n prepared for the last year"
(1,652 real changes made)

. replace preparedness_stage = 4 if ST_STG1Thinkingaboutpreparing == "I have bee
> n prepared for MORE than a year and I continue preparing"
(1,576 real changes made)

. replace preparedness_stage = . if ST_STG1Thinkingaboutpreparing == "Don't know
> "
(0 real changes made)

. replace preparedness_stage = . if ST_STG1Thinkingaboutpreparing == "Prefer not
>  to answer"
(0 real changes made)

. 
. label define Preparedness_stage_label ///
>         0 "I am NOT prepared, and I do not intend to prepare in the next year"
>  ///
>         1 "I am NOT prepared, but I intend to start preparing in the next year
> " ///
>         2 "I am NOT prepared, but I intend to get prepared in the next six mon
> ths" ///
>         3 "I have been prepared for the last year" ///
>         4 "I have been prepared for MORE than a year and I continue preparing"

. label values preparedness_stage Preparedness_stage_label

. label var preparedness_stage "Preparedness Stage"

. tab ST_STG1Thinkingaboutpreparing preparedness_stage, m

     ST_STG1 Thinking |
      about preparing |
       yourself for a |
   disaster, which of |             Preparedness Stage
        the following | I am NOT   I am NOT   I am NOT   I have be |     Total
----------------------+--------------------------------------------+----------
           Don't know |         0          0          0          0 |       375 
I am NOT prepared, .. |       812          0          0          0 |       812 
I am NOT prepared, .. |         0          0      1,523          0 |     1,523 
I am NOT prepared, .. |         0      1,247          0          0 |     1,247 
I have been prepare.. |         0          0          0          0 |     1,576 
I have been prepare.. |         0          0          0      1,652 |     1,652 
 Prefer not to answer |         0          0          0          0 |        12 
----------------------+--------------------------------------------+----------
                Total |       812      1,247      1,523      1,652 |     7,197 


     ST_STG1 Thinking |
      about preparing |
       yourself for a |
   disaster, which of |  Preparedness Stage
        the following | I have be          . |     Total
----------------------+----------------------+----------
           Don't know |         0        375 |       375 
I am NOT prepared, .. |         0          0 |       812 
I am NOT prepared, .. |         0          0 |     1,523 
I am NOT prepared, .. |         0          0 |     1,247 
I have been prepare.. |     1,576          0 |     1,576 
I have been prepare.. |         0          0 |     1,652 
 Prefer not to answer |         0         12 |        12 
----------------------+----------------------+----------
                Total |     1,576        387 |     7,197 

. 
. //Preparedness stage recode for histograms
. tab preparedness_stage

                     Preparedness Stage |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
I am NOT prepared, and I do not intend  |        812       11.92       11.92
I am NOT prepared, but I intend to star |      1,247       18.31       30.23
I am NOT prepared, but I intend to get  |      1,523       22.36       52.60
 I have been prepared for the last year |      1,652       24.26       76.86
I have been prepared for MORE than a ye |      1,576       23.14      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,810      100.00

. tab preparedness_stage, nolab

Preparednes |
    s Stage |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        812       11.92       11.92
          1 |      1,247       18.31       30.23
          2 |      1,523       22.36       52.60
          3 |      1,652       24.26       76.86
          4 |      1,576       23.14      100.00
------------+-----------------------------------
      Total |      6,810      100.00

. 
. gen not_prepared = .
(7,197 missing values generated)

. replace not_prepared = 1 if preparedness_stage == 0
(812 real changes made)

. label define Not_prepared_label 1 "I am NOT prepared, and I do not intend to p
> repare in the next year"

. label values not_prepared Not_prepared_label

. tab not_prepared

                           not_prepared |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
I am NOT prepared, and I do not intend  |        812      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |        812      100.00

. 
. gen intend_prep_year = .
(7,197 missing values generated)

. replace intend_prep_year = 1 if preparedness_stage == 1
(1,247 real changes made)

. label define Intend_prep_year 1 "I am NOT prepared, but I intend to start prep
> aring in the next year"

. label values intend_prep_year Intend_prep_year

. tab intend_prep_year

                       intend_prep_year |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
I am NOT prepared, but I intend to star |      1,247      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      1,247      100.00

. 
. gen intend_prep_6months = .
(7,197 missing values generated)

. replace intend_prep_6months = 1 if preparedness_stage == 2
(1,523 real changes made)

. label define Intend_prep_6months 1 "I am NOT prepared, but I intend to get pre
> pared in the next six months"

. label values intend_prep_6months Intend_prep_6months

. tab intend_prep_6months

                    intend_prep_6months |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
I am NOT prepared, but I intend to get  |      1,523      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      1,523      100.00

. 
. gen prepared_year = .
(7,197 missing values generated)

. replace prepared_year = 1 if preparedness_stage == 3
(1,652 real changes made)

. label define Prepared_year 1 "I have been prepared for the last year"

. label values prepared_year Prepared_year

. tab prepared_year

                         prepared_year |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
I have been prepared for the last year |      1,652      100.00      100.00
---------------------------------------+-----------------------------------
                                 Total |      1,652      100.00

. 
. gen prepared_overyear= .
(7,197 missing values generated)

. replace prepared_overyear = 1 if preparedness_stage == 4
(1,576 real changes made)

. label define Prepared_overyear 1 "I have been prepared for MORE than a year an
> d I continue preparing"

. label values prepared_overyear Prepared_overyear

. tab prepared_overyear

                      prepared_overyear |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
I have been prepared for MORE than a ye |      1,576      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      1,576      100.00

. 
. save $data/2021_NHS_general_data_disd02.dta, replace
file
    ~/Documents/SocResearch/climate_disability/disability_disaster_response/da
    > ta/2021_NHS_general_data_disd02.dta saved

. 
. ***--------------------------***
. log close 
      name:  <unnamed>
       log:  /Users/mmking/Documents/SocResearch/climate_disability/disability_d
> isaster_response/stata/disd02_variables.log
  log type:  text
 closed on:  25 Sep 2025, 17:42:55
--------------------------------------------------------------------------------
